package lesson_SHK.code.object_oriented.day9;
/*
一、package关键字的使用
1. 为了更好的管理项目中类的管理，提供package(包)。
2. 使用package声明类或接口所属的包，声明在源文件的首行。
3. 包，属于标识符，遵循标识符的命名规则规范（xxxyyyzzz）、见名知意。
4. 每有一个"."，就代表一层文件目录。

补充：同一个包下，不能命名同名的接口、类。

二、import关键字的使用
1. 在源文件中显示地使用import结构导入指定包下的类、接口。
2. 声明在包的声明和类的声明之间。
3. 如果需要导入多个结构，则并列写出即可。
4. 可以使用"xxx.*"的方式，导入xxx包下的所有结构。
5. 定义在java.lang包下的类或接口，可以省略import结构。
6. 当前包下定义的类或接口，也可以省略import结构。
7. 如果在源文件中，使用了不同包下的同名类，则必须至少有一个类需要以全类名的方式显示。
8. "xxx.*"只能导入xxx包下的类，若要使用xxx子包下的类，则仍需显示导入。

9. import static: 导入指定类或接口中的静态结构。
 */
public class i_PackageImportTest {

}
